#!/usr/bin/python
# encoding:utf8
import sys

position_map = {
        0: u"车头", 
        1: u"车尾", 
        2: u"头侧", 
        3: u"尾侧", 
        4: u"正侧", 
        5: u"头侧-临界状态", 
        6: u"尾侧-临界状态", 
        -1: u"未知"
}
       
car_kind_map = {
        0: u"其他",
        1: u"轿车", 
        2: u"越野车", 
        3: u"商务车", 
        4: u"小型货车",
        5: u"大型货车", 
        6: u"轻客",
        7: u"小型客车", 
        8: u"大型客车", 
        9: u"三轮车",
        10: u"微面", 
        11: u"皮卡车", 
        12: u"挂车", 
        13: u"混凝土搅拌车",
        14: u"罐车",
        15: u"随车吊", 
        16: u"消防车", 
        17: u"渣土车", 
        18: u"押运车", 
        19: u"工程抢修车",
        20: u"救援车", 
        21: u"栏板卡车", 
        22: u"二轮车", 
        23: u"自行车", 
        24: u"行人",
        25: u"小型栏板",
        26: u"轻卡",
        27: u"救护车",
        28: u"非载货作业车"
}

car_color_map = {
        1: u"黑色", 
        2: u"蓝色", 
        3: u"棕色", 
        4: u"绿色", 
        5: u"银色",
        6: u"白色", 
        7: u"红色", 
        8: u"黄色", 
        9: u"粉色", 
        10: u"紫色",
        11: u"青色", 
        12: u"深灰色", 
        13: u"金色", 
        14: u"墨绿色",
        15: u"浅蓝色",
        16: u"橘红色",
        17: u"橘黄色",
        0: u"其他"
}
    
car_type_map = {
        1: u"靠边不完整", 
        2: u"有遮挡", 
        3: u"方向相反", 
        4: u"倾斜角度（较大）",
        5: u"加长车身", 
        6:u"无车牌", 
        0: u"正常"
}

belt_map = {0: u"模糊，未确定", 1: u"系安全带", 2: u"未系安全带", 3: u"图片模糊"}

phone_map = {
        0: "图片模糊",
        1: "疑似打电话",
        2: "未打电话",
        3: "拿电话",
        4: "确定看到打电话",
        99: "未知，无法确定"
    }

danger_map = {0: u"模糊，未确定", 1: u"危化品", 2: u"非危化品"}

crash_map = {0: u"模糊，未确定", 1: u"撞损", 2: u"未撞损"}

tollstation_map = {
        0: u"其他或未知", 
        1: u"一类(客)", 
        2: u"二类(客)",
        4: u"三类(客)", 
        8: u"四类(客)",
        3: u"一类，二类(客)",
        6: u"二类，三类(客)", 
        12: u"三类，四类(客)",
        7: u"一类，二类，三类(客)",
        14: u"二类，三类，四类(客)",
        16: u"一类(货)", 
        32: u"二类(货)",
        64: u"三类(货)", 
        128: u"四类(货)", 
        256: u"五类(货)",
        48: u"一类，二类(货)",
        96: u"二类，三类(货)",
        192: u"三类，四类(货)",
        384: u"四类，五类(货)",
        112: u"一类，二类，三类(货)",
        224: u"二类，三类，四类(货)",
        448: u"三类，四类，五类(货)"
}

separation_map = {
        0: u"其他", 
        1: u"轿车", 
        2: u"货车", 
        3: u"客车",
        4: u"三轮车", 
        5: u"面包车", 
        6: u"二轮车", 
        7: u"自行车",
        8: u"行人",
        9: u"打码框",
        10: u"骑车人",
        11: u"坐车人",
        12: u"非步行儿童（抱着，推着等）"
}

plate_color_map = {0: u"其他", 1: u"黄色", 2: u"蓝色", 3: u"黑色", 4: u"白色", 5: u"绿色",
        6: u"新能源-渐变绿色", 7: u"新能源-黄绿双拼"}

plate_mode_map = {0: u"未知", 1: u"普通车牌-单层", 2: u"普通车牌-双层", 3: u"新能源-单层", 4:u"非大陆-单层", 5: u"非大陆-双层"}

plate_type_map = {
        1: u"大型汽车号牌", 
        2: u"小型汽车号牌", 
        3: u"使馆汽车号牌", 
        4: u"领馆汽车号牌",
        5: u"境外汽车号牌", 
        6: u"外籍汽车号牌", 
        7: u"两、三轮摩托车号牌",
        8: u"轻便摩托车号牌",  
        9: u"使馆摩托车号牌", 
        10: u"领馆摩托车号牌",
        11: u"境外摩托车号牌", 
        12: u"外籍摩托车号牌", 
        13: u"农用运输车号牌",
        14: u"拖拉机号牌", 
        15: u"挂车号牌", 
        16: u"教练汽车号牌", 
        17: u"教练摩托车号牌",
        18: u"试验汽车号牌", 
        19: u"试验摩托车号牌", 
        20: u"临时人境汽车号牌",
        21: u"临时人境摩托车号牌", 
        22: u"临时行驶车号牌", 
        23: u"警用汽车号牌",
        24: u"警用摩托号牌", 
        26: u"香港入出境车", 
        27: u"澳门入出境车", 
        31: u"武警号牌",
        32: u"军队号牌", 
        99: u"其他号牌"
}

mistake_map = {0: u"未知", 1: u"未误检", 2: u"误检"}

gender_map = {0: u"图片模糊", 1: u"男", 2: u"女", 99: u"未知，无法确定"}

age_map = {
        0: u"图片模糊", 
        1: u"儿童", 
        2: u"青年", 
        3: u"中年", 
        4: u"老年",
        5: u"少年",
        99: u"未知，无法确定"
}

hat_map = {0: u"图片模糊", 1: u"无", 2: u"戴帽子", 3: u"戴头盔", 4: u"连衣帽", 5: u"头巾", 99: u"未知，无法确定"}

orientation_map = {0: u"未知", 1: u"前面", 2: u"后面", 3: u"侧面"}

bag_map = {0: u"图片模糊", 1: u"拎包", 2: u"未拎包", 99: u"未知，无法确定"}

knapsack_map = {
        0: u"图片模糊", 
        1: u"无包", 
        2: u"背包(有包体)", 
        3: u"有包(无包体)",
        99: u"未知，无法确定"        
}

clothes_color_map = {
        0: u"图片模糊", 
        1: u"灰色", 
        2: u"白色", 
        3: u"红色",
        4: u"绿色", 
        5: u"蓝色", 
        6: u"黄色", 
        7: u"黑色", 
        8: u"紫色",
        9: u"深灰",
        10: u"橙色",
        11: u"棕色",
        12: u"青色",
        13: u"粉色",
        14: u"墨绿色",
        15: u"浅蓝色",
        16: u"荧光绿",
        17: u"军绿色",
        99: u"未知，无法确定"        
}

person_has_map = {0: u"图片模糊", 1: u"无", 2: u"有", 99: u"未知，无法确定"}

hari_map = {
        0: u"图片模糊",
        1: u"长发",
        2: u"短发",
        3: u"马尾",
        4: u"看不到头发",
        5: u"盘发",
        6: u"光头",
        99: u"未知，无法确定",
}

person_upper_type_map = {0: "图片模糊", 1: "长袖", 2: "短袖", 99: "未知，无法确定"}

person_bottom_type_map = {
        0: "图片模糊",
        1: "长裤",
        2: "短裤",
        3: "七分裤",
        4: "裙子",
        99: "未知，无法确定"
}

person_phone_map = {  
        0: "图片模糊",
        1: "疑似打电话",
        2: "未打电话",
        3: "拿电话",
        4: "确定看到打电话",
        99: "未知，无法确定"
}

person_baby_map = {
        0: "图片模糊",
        1: "抱小孩",
        2: "未抱小孩",
        3: "背小孩",
        99: "未知，无法确定"
}

# ext_box_map = {
#     'face_box': {
#         'table': 'samp_person',
#         'name': '人脸位置',
#         'box_type': 1
#     },
#     'trunk_box': {
#         'table': 'samp_person',
#         'name': '行李箱位置'
#         'box_type': 2
#     }, 
#     'bag_box': {
#         'table': 'samp_person',
#         'name': '手提包',
#         'box_type': 3
#     }
# }

ext_box_type_map = {
    1: 'face_box',
    2: 'trunk_box',
    3: 'bag_box'
}

anti_ext_box_type_map = {}

for k, v in ext_box_type_map.items():
    anti_ext_box_type_map[v] = k

box_type_map = {
    2: "行李箱框",
    3: "手提包框"
}


function_map = {
        1: position_map,
        3: car_kind_map,
        4: car_color_map,
        6: plate_type_map,
        7: plate_color_map,
        8: plate_mode_map,
        9: belt_map,
        10: phone_map,
        11: car_type_map,
        17: danger_map,
        20: tollstation_map,
        21: separation_map,
        22: mistake_map,
        23: gender_map,
        24: age_map,
        25: hat_map,
        26: bag_map,
        27: knapsack_map,
        28: clothes_color_map,
        29: clothes_color_map,
        30: orientation_map,
        31: crash_map,
        32: person_has_map,
        33: person_has_map,
        34: person_has_map,
        35: person_has_map,
        36: person_has_map,
        39: hari_map,
        40: person_upper_type_map,
        41: person_bottom_type_map,
        42: person_has_map,
        43: clothes_color_map,
        44: clothes_color_map,
        45: person_has_map,
        46: person_phone_map,
        47: person_baby_map,
        90: box_type_map
}



